package SWResource_wa_w51;

#----------------------------------------
# キャラセット
#----------------------------------------

sub GetRSChr {
  my $sow = $_[0];

  my $maker = $sow->{'cfg'}->{'CID_MAKER'};
  my $admin = $sow->{'cfg'}->{'CID_ADMIN'};


  # 表\示順
  my @all = ('w05', 'w21', 'w22', 'w36', 'w16', 'w18', 'w26', 'w35', 'w24', 'w37', 'w29', 'w20', 'w31', 'w12', 'w10', 'w25', 'w09', 'w30', 'w14', 'w13', 'w11', 'w03', 'w34', 'w27', 'w28', 'w17', 'w39', 'w08', 'w43', 'w07', 'w40', 'w33', 'w23', 'w04', 'w06', 'w38', 'w01', 'w15', 'w32', 'w02', 'w44', 'w45', 'w46', 'w47', 'w48', 'w49', 'w50', 'w51', 'w52', 'w53', 'w54', 'w55', 'w56', 'w57', 'w58', 'w59');
  my @shoji = ('w05', 'w21', 'w22', 'w36', 'w16', 'w18', 'w26', 'w35', 'w24', 'w37', 'w29', 'w20', 'w31', 'w12', 'w10', 'w25', 'w09', 'w30', 'w14', 'w13', 'w11', 'w03', 'w34', 'w27', 'w28', 'w17', 'w39', 'w08', 'w43', 'w07', 'w40', 'w33', 'w23', 'w04', 'w06', 'w38', 'w01', 'w15', 'w32', 'w02', 'w44', 'w45', 'w46', 'w47', 'w48', 'w49', 'w50', 'w51', 'w52', 'w53', 'w54', 'w55', 'w56', 'w57', 'w58', 'w59');
  my %chrorder = (
    'all' => \@all,
    'shoji' => \@shoji,
  );

  my @tag_order = ('shoji');
  my @order = ('w05', 'w21', 'w22', 'w36', 'w16', 'w18', 'w26', 'w35', 'w24', 'w37', 'w29', 'w20', 'w31', 'w12', 'w10', 'w25', 'w09', 'w30', 'w14', 'w13', 'w11', 'w03', 'w34', 'w27', 'w28', 'w17', 'w39', 'w08', 'w43', 'w07', 'w40', 'w33', 'w23', 'w04', 'w06', 'w38', 'w01', 'w15', 'w32', 'w02', 'w44', 'w45', 'w46', 'w47', 'w48', 'w49', 'w50', 'w51', 'w52', 'w53', 'w54', 'w55', 'w56', 'w57', 'w58', 'w59');


  # キャラの肩書き
  my %chrjob = (
    'w01' => '役者',
    'w02' => '浪人',
    'w03' => '忍者',
    'w04' => '町娘',
    'w05' => '飴師',
    'w06' => '巫女',
    'w07' => '双子',
    'w08' => '双子',
    'w09' => '宣教師',
    'w10' => '刺客',
    'w11' => '釣り師',
    'w12' => '女中',
    'w13' => '団子屋',
    'w14' => '手妻師',
    'w15' => '山姥',
    'w16' => '髪結い',
    'w17' => '病人',
    'w18' => '後妻',
    'w20' => '呉服問屋',
    'w21' => 'うどん職人',
    'w22' => 'そば職人',
    'w23' => '弁士',
    'w24' => '喧嘩屋',
    'w25' => '説法師',
    'w26' => '餓鬼大将',
    'w27' => '発明家',
    'w28' => '飛脚',
    'w29' => '琴弾き',
    'w30' => '宗主',
    'w31' => '子守り',
    'w32' => '落胤',
    'w33' => '船大工',
    'w34' => '野伏り',
    'w35' => '神主',
    'w36' => '楽士',
    'w37' => '薬売り',
    'w38' => '門下生',
    'w39' => '武家の娘',
    'w40' => '懐刀',
    'w43' => '丁稚',
    'w44' => '機織り',
    'w45' => '座敷守',
    'w46' => '屍漁り',
    'w47' => '肥代取り',
    'w48' => '和算家',
    'w49' => '抜荷',
    'w50' => '半の目',
    'w51' => '真剣師',
    'w52' => '看板娘',
    'w53' => '旅籠',
    'w54' => '大旦那',
    'w55' => '丑の刻参り',
    'w56' => '御免株',
    'w57' => '陰陽師',
    'w58' => '師範棋士',
    'w59' => '儺遣',
    $maker => '稲荷のお告げ',
    $admin => '闇の呟き',
  );

  # キャラの名前
  my %chrname = (
    'w01' => '鏡花',
    'w02' => '慶三郎',
    'w03' => '朔',
    'w04' => '小鈴',
    'w05' => '定吉',
    'w06' => 'ゆり',
    'w07' => '夕顔',
    'w08' => '朝顔',
    'w09' => 'チャールズ',
    'w10' => '博史',
    'w11' => '沼太郎',
    'w12' => 'おみつ',
    'w13' => 'たまこ',
    'w14' => '華月斎',
    'w15' => '八重',
    'w16' => '勢',
    'w17' => '雷門',
    'w18' => '菊',
    'w20' => '藤之助',
    'w21' => '鉄平',
    'w22' => '竹三',
    'w23' => '仁右衛門',
    'w24' => '辰次',
    'w25' => '法泉',
    'w26' => '勝丸',
    'w27' => '源蔵',
    'w28' => '甚六',
    'w29' => '志乃',
    'w30' => '雪代',
    'w31' => '日向',
    'w32' => '明之進',
    'w33' => '団十\郎',
    'w34' => '余四朗',
    'w35' => '奈須麿',
    'w36' => 'ウト',
    'w37' => '芙蓉',
    'w38' => '一平太',
    'w39' => '沙耶',
    'w40' => '朧',
    'w43' => '春松',
    'w44' => '雪客',
    'w45' => '亀吉',
    'w46' => '梅子',
    'w47' => '置壱',
    'w48' => '直円',
    'w49' => '錠',
    'w50' => '丁助',
    'w51' => '鬼丞',
    'w52' => '櫻子',
    'w53' => 'おもん',
    'w54' => '舷之丈',
    'w55' => '網斎',
    'w56' => '大八郎',
    'w57' => '稲荷',
    'w58' => '千早',
    'w59' => '沙羅',
    $maker    => '（村建て人）',
    $admin    => '（管理人）',
  );

  # ダミーキャラの発言
  my @npcsay =(
    "カカカ……、如何様ってお前よ。<br>わかってんのか？　隅々まで調べてよ、なあんにも出なけりゃよ？<br><br>おう！　場の十\倍、耳揃えて出すんだろうな！",
    "よう。邪魔するよ。<br>あんた《薬喰い》だろ？　このしみったれ野郎を買ってくれよ。<br><br>まったまったまった！<br>俺はほら、ささやかな金子がいただけりゃあって、それだけの用事なわけよ。わかるだろ。な？<br><br>侍には黙ってるから、よ。<br>もちつもたれつ、仲良くしようぜ……",
  );

  my @expression = (
  );

  my %charset = (
    CAPTION        => '和の国てやんでえ（鬼丞）',
    NPCID          => 'w51',
    TAG_ORDER      => \@tag_order,
    CHRORDER       => \%chrorder,
    CHRNAME        => \%chrname,
    CHRJOB         => \%chrjob,
    ORDER          => \@order,
    NPCSAY         => \@npcsay,
    IMGFACEW       => 90,
    IMGFACEH       => 130,
    IMGBODYW       => 90,
    IMGBODYH       => 130,
    DIR            => "$sow->{'cfg'}->{'DIR_IMG'}/portrate",
    EXT            => '.jpg',
    BODY           => '',
    FACE           => '',
    GRAVE          => '',
    EXPRESSION     => \@expression,
    LAYOUT_NAME    => 'right',
  );

  return \%charset;
}

1;
