package SWResource_fable;

#----------------------------------------
# キャラセット
#----------------------------------------

sub GetRSChr {
  my $sow = $_[0];

  my $maker = $sow->{'cfg'}->{'CID_MAKER'};
  my $admin = $sow->{'cfg'}->{'CID_ADMIN'};


  # 表\示順
  my @all = ('f000', 'f1', 'f2', 'f3', 'f4', 'f5', 'f6', 'f7', 'f8', 'f9', 'f10', 'f11', 'f12', 'f13', 'f14', 'f15', 'f16', 'f17', 'f18', 'f20', 'f21', 'f22', 'f23', 'f24', 'f25', 'f26', 'f27', 'f28', 'f29', 'f30', 'f31', 'f32', 'f33', 'fw07', 'f34', 'f35', 'f36', 'fw01', 'fw02', 'fw03', 'fw04', 'fw05', 'fw06');
  my @fable = ('f000', 'f1', 'f2', 'f3', 'f4', 'f5', 'f6', 'f7', 'f8', 'f9', 'f10', 'f11', 'f12', 'f13', 'f14', 'f15', 'f16', 'f17', 'f18', 'f20', 'f21', 'f22', 'f23', 'f24', 'f25', 'f26', 'f27', 'f28', 'f29', 'f30', 'f31', 'f32', 'f33', 'fw07', 'f34', 'f35', 'f36', 'fw01', 'fw02', 'fw03', 'fw04', 'fw05', 'fw06');
  my %chrorder = (
    'all' => \@all,
    'fable' => \@fable,
  );

  my @tag_order = ('fable');
  my @order = ('f000', 'f1', 'f2', 'f3', 'f4', 'f5', 'f6', 'f7', 'f8', 'f9', 'f10', 'f11', 'f12', 'f13', 'f14', 'f15', 'f16', 'f17', 'f18', 'f20', 'f21', 'f22', 'f23', 'f24', 'f25', 'f26', 'f27', 'f28', 'f29', 'f30', 'f31', 'f32', 'f33', 'fw07', 'f34', 'f35', 'f36', 'fw01', 'fw02', 'fw03', 'fw04', 'fw05', 'fw06');


  # キャラの肩書き
  my %chrjob = (
    'f000' => '日輪代理',
    'f1' => '酪農家',
    'f10' => '食通虹蛇',
    'f11' => 'アララー伯',
    'f12' => '鉄騎兵',
    'f13' => '空挺帆走',
    'f14' => '炎天の雷光',
    'f15' => '憑依呪術師',
    'f16' => '鉄騎従兵',
    'f17' => '鳳凰の実',
    'f18' => '精留醸造',
    'f2' => '竜騎兵',
    'f20' => '仲買呪術師',
    'f21' => '刻字座',
    'f22' => '道祖神',
    'f23' => '雲水',
    'f24' => '血吸茸',
    'f25' => '傍観',
    'f26' => '飢奢髑髏',
    'f27' => '歌舞伎座',
    'f28' => '辣醤醸造',
    'f29' => '琺瑯座',
    'f3' => '三等兵',
    'f30' => 'ぬっぺっぽう',
    'f31' => '瀑布昇竜道',
    'f32' => '彩鞄座',
    'f33' => '網鉱座',
    'f34' => '浮穴沫媛',
    'f35' => '質草座',
    'f36' => 'ランタン',
    'f4' => '測量座',
    'f5' => '宝珠',
    'f6' => '飛脚座',
    'f7' => '八元&#x283;∫干渉',
    'f8' => 'キンジン',
    'f9' => '類感呪術師',
    'fw01' => '尸解仙道',
    'fw02' => '奏楽神',
    'fw03' => '護法善隊',
    'fw04' => '御免株',
    'fw05' => '羽化昇天道',
    'fw06' => '経凛々',
    'fw07' => '恩賜神',
    $maker => '日輪の煌めき',
    $admin => '混沌の海の寝返り',
  );

  # キャラの名前
  my %chrname = (
    'f000' => 'ロゴス',
    'f1' => 'ヨグラージ',
    'f10' => 'ンゴティエク',
    'f11' => 'D.バルベルデ',
    'f12' => 'ソ\ルフリッツィ',
    'f13' => 'ティム',
    'f14' => 'インティJr',
    'f15' => 'ケトゥートゥ',
    'f16' => 'イェンキンス',
    'f17' => 'モイ',
    'f18' => 'ミタシュ',
    'f2' => 'アーサー',
    'f20' => 'ジェルマン',
    'f21' => 'ヴェルヌイユ',
    'f22' => 'オグン',
    'f23' => 'ハロ',
    'f24' => 'ギロチン',
    'f25' => 'ワヤン',
    'f26' => 'ビジリア',
    'f27' => 'キランディ',
    'f28' => 'ガルム',
    'f29' => 'ポピン',
    'f3' => 'ロバート',
    'f30' => 'チャルケ',
    'f31' => 'バキュラム',
    'f32' => 'ムスタファ',
    'f33' => 'ボルドーン',
    'f34' => 'スプスプイ',
    'f35' => 'パジャク',
    'f36' => 'ジル',
    'f4' => 'ハラフ',
    'f5' => 'コーラ',
    'f6' => 'タイム',
    'f7' => 'タプル',
    'f8' => 'ソ\ランジュ',
    'f9' => 'ヘリンヘイモ',
    'fw01' => 'ツェン',
    'fw02' => 'ディ♪ジアン',
    'fw03' => 'ヤツデ',
    'fw04' => 'ギョウブ',
    'fw05' => 'イナリ',
    'fw06' => 'ストラピタカ',
    'fw07' => 'コアトリクエ',
    $maker    => '（村建て人）',
    $admin    => '（管理人）',
  );

  # ダミーキャラの発言
  my @npcsay =(
    "おはよう。熾火の子供達。<br>希望の朝はまだだけれど、マナとなり、パンとなる日輪の朝がきたよ。<br><br>さあ、戦をよそう。<br>吾と汝とわかちあい、育み、創り、愛して生きよう。",
    "汝は大嵐を起こそうとしている。<br>希望はその箱にはもうないのだ。<br><br>よしなさい。黄昏よりも昏き者よ。<br><br>だが、それでも。<br>信じて待てば、かならず―\―\",
  );

  my @expression = (
  );

  my %charset = (
    CAPTION        => 'エクスパンション・セット「幻日世界」',
    NPCID          => 'f000',
    TAG_ORDER      => \@tag_order,
    CHRORDER       => \%chrorder,
    CHRNAME        => \%chrname,
    CHRJOB         => \%chrjob,
    ORDER          => \@order,
    NPCSAY         => \@npcsay,
    IMGFACEW       => 90,
    IMGFACEH       => 130,
    IMGBODYW       => 90,
    IMGBODYH       => 130,
    DIR            => "$sow->{'cfg'}->{'DIR_IMG'}/portrate",
    EXT            => '.jpg',
    BODY           => '',
    FACE           => '',
    GRAVE          => '',
    EXPRESSION     => \@expression,
    LAYOUT_NAME    => 'right',
  );

  return \%charset;
}

1;
