package SWResource_changed_m05;

#----------------------------------------
# キャラセット
#----------------------------------------

sub GetRSChr {
  my $sow = $_[0];

  my $maker = $sow->{'cfg'}->{'CID_MAKER'};
  my $admin = $sow->{'cfg'}->{'CID_ADMIN'};


  # 表\示順
  my @all = ('m99', 'm06', 'm03', 'm05', 'm15', 'm07', 'r30', 'm01', 'm02', 'm04', 'b44', 'm08', 'b49', 'm09', 'm10', 'm12', 'm11', 'm13', 'm14', 'm16', 'm18', 'm19', 'm20');
  my @myth = ('m99', 'm06', 'm03', 'm05', 'm15', 'm07', 'r30', 'm01', 'm02', 'm04', 'b44', 'm08', 'b49', 'm09', 'm10', 'm12', 'm11', 'm13', 'm14', 'm16', 'm18', 'm19', 'm20');
  my %chrorder = (
    'all' => \@all,
    'myth' => \@myth,
  );

  my @tag_order = ('myth');
  my @order = ('m99', 'm06', 'm03', 'm05', 'm15', 'm07', 'r30', 'm01', 'm02', 'm04', 'b44', 'm08', 'b49', 'm09', 'm10', 'm12', 'm11', 'm13', 'm14', 'm16', 'm18', 'm19', 'm20');


  # キャラの肩書き
  my %chrjob = (
    'b44' => 'こあくとう',
    'b49' => 'いしく',
    'm01' => 'ようせい',
    'm02' => 'ようせい',
    'm03' => 'しょうぐん',
    'm04' => 'すくみず',
    'm05' => 'はおう',
    'm06' => 'きゅうていがか',
    'm07' => 'こひつじ',
    'm08' => 'おふくろのあじ',
    'm09' => 'しーさー',
    'm10' => 'ころぽっくる',
    'm11' => '神聖騎士',
    'm12' => '暗黒騎士',
    'm13' => '調律師',
    'm14' => '奇跡の子',
    'm15' => 'びじん',
    'm16' => 'りゅうきへい',
    'm18' => '記号の妖精',
    'm19' => 'おひめさま',
    'm20' => 'げぼく',
    'm99' => 'かみさま',
    'r30' => 'ひとづかい',
    $maker => '広場のお告げ',
    $admin => '闇の呟き',
  );

  # キャラの名前
  my %chrname = (
    'b44' => 'ドナルド',
    'b49' => 'ボリス',
    'm01' => 'ケムシ',
    'm02' => 'ポプラ',
    'm03' => 'トノサマ',
    'm04' => 'アオイ',
    'm05' => 'ナナコロ',
    'm06' => 'リリンラ',
    'm07' => 'アリス',
    'm08' => 'おっぱい',
    'm09' => 'カミジャー',
    'm10' => 'アチャポ',
    'm11' => 'ライトニング',
    'm12' => 'トルニトス',
    'm13' => 'ミケ',
    'm14' => 'カリュクス',
    'm15' => 'ミソ\チャ',
    'm16' => 'アーサー',
    'm18' => 'ミーム',
    'm19' => 'タルト',
    'm20' => 'ショコラ',
    'm99' => 'パルック',
    'r30' => 'トリ',
    $maker    => '（村建て人）',
    $admin    => '（管理人）',
  );

  # ダミーキャラの発言
  my @npcsay =(
    "ママ？ママなの？<br>…もう大丈夫なの？ここには人狼なんていないのかい？<br><br>…そっかあ…<br><br><br>人狼だって？！",
    "誰にも、腰抜けなんて…言わせないぞっ",
  );

  my @expression = (
  );

  my %charset = (
    CAPTION        => 'はおうの広場',
    NPCID          => 'm05',
    TAG_ORDER      => \@tag_order,
    CHRORDER       => \%chrorder,
    CHRNAME        => \%chrname,
    CHRJOB         => \%chrjob,
    ORDER          => \@order,
    NPCSAY         => \@npcsay,
    IMGFACEW       => 90,
    IMGFACEH       => 130,
    IMGBODYW       => 90,
    IMGBODYH       => 130,
    DIR            => "$sow->{'cfg'}->{'DIR_IMG'}/portrate",
    EXT            => '.jpg',
    BODY           => '',
    FACE           => '',
    GRAVE          => '',
    EXPRESSION     => \@expression,
    LAYOUT_NAME    => 'right',
  );

  return \%charset;
}

1;
