package SWResource_time;

#----------------------------------------
# キャラセット
#----------------------------------------

sub GetRSChr {
  my $sow = $_[0];

  my $maker = $sow->{'cfg'}->{'CID_MAKER'};
  my $admin = $sow->{'cfg'}->{'CID_ADMIN'};


  # 表\示順
  my @all = ('c09', 'c10', 't34', 't03', 't31', 't01', 't02', 't04', 't05', 't06', 't09', 't10', 't12', 't13', 't14', 't15', 't16', 't19', 't18', 't17', 't11', 't07', 't21', 't08', 't29', 't35', 't22', 't20', 't23', 't24', 't25', 't26', 't27', 't28', 't30', 't32', 't33');
  my @travel = ('c09', 'c10', 't34', 't03', 't31', 't01', 't02', 't04', 't05', 't06', 't09', 't10', 't12', 't13', 't14', 't15', 't16', 't19', 't18', 't17', 't11', 't07', 't21', 't08', 't29', 't35', 't22', 't20', 't23', 't24', 't25', 't26', 't27', 't28', 't30', 't32', 't33');
  my %chrorder = (
    'all' => \@all,
    'travel' => \@travel,
  );

  my @tag_order = ('travel');
  my @order = ('c09', 'c10', 't34', 't03', 't31', 't01', 't02', 't04', 't05', 't06', 't09', 't10', 't12', 't13', 't14', 't15', 't16', 't19', 't18', 't17', 't11', 't07', 't21', 't08', 't29', 't35', 't22', 't20', 't23', 't24', 't25', 't26', 't27', 't28', 't30', 't32', 't33');


  # キャラの肩書き
  my %chrjob = (
    'c09' => '暗殺教団',
    'c10' => '小銃協会',
    't01' => '友愛組合',
    't02' => '幸運の科学',
    't03' => 'FSM団',
    't04' => '截拳道',
    't05' => '開放的市民',
    't06' => '死ね死ね団',
    't07' => '勧善懲悪委',
    't08' => '覆面嫉妬団',
    't09' => '匿名軍団',
    't10' => '営利政府',
    't11' => '鷹の爪団',
    't12' => '地下鉄道',
    't13' => 'MNU機関',
    't14' => '猫の集会',
    't15' => '少年探偵団',
    't16' => '安全保障局',
    't17' => '薔薇∴十\字',
    't18' => '白銀∴秘星',
    't19' => '聖戦士募集',
    't20' => 'MI:18',
    't21' => '九未知会',
    't22' => '学園特警',
    't23' => '孤高天使連合',
    't24' => 'トレーサー',
    't25' => '2.14革命機構\',
    't26' => '法隆寺',
    't27' => '硯友社',
    't28' => '樫の樹の子ら',
    't29' => '透明女子会',
    't30' => '旅団&#x2721;肘笠雨',
    't31' => '呵呵老会',
    't32' => '安全調査局',
    't33' => '亡命同盟',
    't34' => '大銃協会',
    't35' => '紅客連盟',
    $maker => '次元X式コンピューター',
    $admin => '第四の壁の深奥',
  );

  # キャラの名前
  my %chrname = (
    'c09' => 'ヒロシ',
    'c10' => 'ゾーイ',
    't01' => 'チアキ',
    't02' => 'リッキィ',
    't03' => 'ミナカタ',
    't04' => 'カイル',
    't05' => 'ジェニファー',
    't06' => 'サミュエル',
    't07' => 'アカリ',
    't08' => 'ミルフィ',
    't09' => 'ゴロウ',
    't10' => 'トレイル',
    't11' => 'マドカ',
    't12' => 'フランク',
    't13' => 'ジャニス',
    't14' => 'クシャミ',
    't15' => 'ガーディ',
    't16' => 'アラン',
    't17' => 'ススム',
    't18' => 'マユミ',
    't19' => 'ハルカ',
    't20' => 'エリ',
    't21' => 'トシミ',
    't22' => 'ケイイチ',
    't23' => 'ナナオ',
    't24' => 'キルロイ',
    't25' => 'ミサキ',
    't26' => 'アツタネ',
    't27' => 'みょんこ',
    't28' => 'リツ',
    't29' => 'ヒナコ',
    't30' => 'ワタヌキ',
    't31' => 'ホウイチ',
    't32' => 'トヨタ',
    't33' => 'エツコ',
    't34' => 'ドン',
    't35' => 'イスルギ',
    $maker    => '（村建て人）',
    $admin    => '（管理人）',
  );

  # ダミーキャラの発言
  my @npcsay =(
    "M4ライフルを持ってさえいれば…、なーんて、思っててもしょうがないね。鍵かけとこう。",
    "やっぱさ、銃を持った善人がいないとさ。<br><br>ちょっと出かけてくる！プリン食べちゃダメだよ！",
  );

  my @expression = (
  );

  my %charset = (
    CAPTION        => 'エクスパンション・セット「帰還者議事」',
    NPCID          => 'c10',
    TAG_ORDER      => \@tag_order,
    CHRORDER       => \%chrorder,
    CHRNAME        => \%chrname,
    CHRJOB         => \%chrjob,
    ORDER          => \@order,
    NPCSAY         => \@npcsay,
    IMGFACEW       => 90,
    IMGFACEH       => 130,
    IMGBODYW       => 90,
    IMGBODYH       => 130,
    DIR            => "$sow->{'cfg'}->{'DIR_IMG'}/portrate",
    EXT            => '.jpg',
    BODY           => '',
    FACE           => '',
    GRAVE          => '',
    EXPRESSION     => \@expression,
    LAYOUT_NAME    => 'right',
  );

  return \%charset;
}

1;
