package SWResource_SF_sf041;

#----------------------------------------
# キャラセット
#----------------------------------------

sub GetRSChr {
  my $sow = $_[0];

  my $maker = $sow->{'cfg'}->{'CID_MAKER'};
  my $admin = $sow->{'cfg'}->{'CID_ADMIN'};


  # 表\示順
  my @all = ('sf01', 'sf02', 'sf03', 'sf04', 'sf05', 'sf06', 'sf025', 'sf07', 'sf08', 'sf09', 'sf10', 'sf11', 'sf12', 'sf13', 'sf18', 'sf19', 'sf14', 'sf15', 'sf16', 'sf17', 'sf20', 'sf021', 'sf023', 'sf024', 'sf026', 'sf022', 'sf027', 'sf032', 'sf028', 'sf029', 'sf030', 'sf031', 'sf033', 'sf034', 'sf035', 'sf036', 'sf037', 'sf038', 'sf039', 'sf040', 'sf041');
  my @stratos = ('sf01', 'sf02', 'sf03', 'sf04', 'sf05', 'sf06', 'sf025', 'sf07', 'sf08', 'sf09', 'sf10', 'sf11', 'sf12', 'sf13', 'sf18', 'sf19', 'sf14', 'sf15', 'sf16', 'sf17', 'sf20', 'sf021', 'sf023', 'sf024', 'sf026', 'sf022', 'sf027', 'sf032', 'sf028', 'sf029', 'sf030', 'sf031', 'sf033', 'sf034', 'sf035', 'sf036', 'sf037', 'sf038', 'sf039', 'sf040', 'sf041');
  my %chrorder = (
    'all' => \@all,
    'stratos' => \@stratos,
  );

  my @tag_order = ('stratos');
  my @order = ('sf01', 'sf02', 'sf03', 'sf04', 'sf05', 'sf06', 'sf025', 'sf07', 'sf08', 'sf09', 'sf10', 'sf11', 'sf12', 'sf13', 'sf18', 'sf19', 'sf14', 'sf15', 'sf16', 'sf17', 'sf20', 'sf021', 'sf023', 'sf024', 'sf026', 'sf022', 'sf027', 'sf032', 'sf028', 'sf029', 'sf030', 'sf031', 'sf033', 'sf034', 'sf035', 'sf036', 'sf037', 'sf038', 'sf039', 'sf040', 'sf041');


  # キャラの肩書き
  my %chrjob = (
    'sf01' => '通信士',
    'sf02' => '哲学者',
    'sf021' => '星間帆走',
    'sf022' => '鉱滓地区',
    'sf023' => '地下軌道',
    'sf024' => '光彩楽団',
    'sf025' => '救星隊',
    'sf026' => '星先案内',
    'sf027' => '鉱滓皇帝',
    'sf028' => '溶接技師',
    'sf029' => '機巧忍軍',
    'sf03' => '道案内',
    'sf030' => '閉鎖管理',
    'sf031' => '意匠造形',
    'sf032' => '鉱滓地区',
    'sf033' => '重層培養',
    'sf034' => '華美人',
    'sf035' => '銀河ギャル',
    'sf036' => '好奇診',
    'sf037' => '執行隊',
    'sf038' => '複眼レフ',
    'sf039' => '秘術販売',
    'sf04' => 'お散歩隊長',
    'sf040' => '電鍍技師',
    'sf041' => '青い星',
    'sf05' => '新製品',
    'sf06' => '士官',
    'sf07' => '遊泳員',
    'sf08' => '服飾商',
    'sf09' => '研修生',
    'sf10' => '保安技師',
    'sf11' => '艇長',
    'sf12' => '廃神',
    'sf13' => '消防隊長',
    'sf14' => '対面販売',
    'sf15' => '忍者隊',
    'sf16' => '保険調査',
    'sf17' => '幽閉児',
    'sf18' => '感性子',
    'sf19' => '理性子',
    'sf20' => '測量士',
    $maker => '重ね合せ猫のユニタリ変換',
    $admin => '黒体放射のエヴェレット解釈',
  );

  # キャラの名前
  my %chrname = (
    'sf01' => 'ラッシード',
    'sf02' => 'エスペラント',
    'sf021' => 'アンタレス',
    'sf022' => 'チェビイ',
    'sf023' => 'エフ',
    'sf024' => 'アイライト',
    'sf025' => 'アマルテア',
    'sf026' => 'ポーラ',
    'sf027' => 'モスキート',
    'sf028' => 'コータ',
    'sf029' => 'ミツボシ',
    'sf03' => 'ピート',
    'sf030' => 'クレパスキュール',
    'sf031' => 'シルク',
    'sf032' => 'ワクラバ',
    'sf033' => 'イースター',
    'sf034' => 'アニュ',
    'sf035' => 'キャンディ',
    'sf036' => 'キカ',
    'sf037' => 'バンアレン',
    'sf038' => 'パラチーノ',
    'sf039' => 'ハロウィン',
    'sf04' => 'アシモフ',
    'sf040' => 'ペサハ',
    'sf041' => '地球',
    'sf05' => 'モナリザ',
    'sf06' => 'ワレンチナ',
    'sf07' => 'ヤンファ',
    'sf08' => 'ＰＪ',
    'sf09' => 'キリシマ',
    'sf10' => 'ナユタ',
    'sf11' => 'イワノフ',
    'sf12' => '†ルシフェル†',
    'sf13' => 'トルドヴィン',
    'sf14' => 'クリスマス',
    'sf15' => 'ジェームス',
    'sf16' => 'ライジ',
    'sf17' => 'ジャック',
    'sf18' => '玖休',
    'sf19' => '参休',
    'sf20' => 'ティソ\',
    $maker    => '（村建て人）',
    $admin    => '（管理人）',
  );

  # ダミーキャラの発言
  my @npcsay =(
    "外の世界を知りたい。古来より、人間のこの意欲ほど、大きな情熱はありません。<br><br>ラニアケアの薄暗い片隅に灯る矮星を巡るこの小さな天体は、おおむねDHMOで覆われています。<br>あたらしい宇宙人が発見されて以来、この瑠璃色の地球に人間は引き付けられてきました。<br><br>数万にのぼる自治政府数、長大な変光星跳躍点列、etc…<br>煩雑さに満ちているにもかかわらず、どうしてこれほどの渡航者を魅了し続けてきたのでしょうか―\―\",
    "大方の予\想に反して、前触れはありませんでした。はじめに生命が失われ、暗闇と構\造が失われたとされています。<br>そして、信仰と知識と、ついには暴\力さえ。<br><br>やがて、かつての資源を得る見込みが失われてしまえば、この地球も、標識のない宇宙の煌きとなるのでしょう。",
  );

  my @expression = (
  );

  my %charset = (
    CAPTION        => '明後日への道標（青い星）',
    NPCID          => 'sf041',
    TAG_ORDER      => \@tag_order,
    CHRORDER       => \%chrorder,
    CHRNAME        => \%chrname,
    CHRJOB         => \%chrjob,
    ORDER          => \@order,
    NPCSAY         => \@npcsay,
    IMGFACEW       => 90,
    IMGFACEH       => 130,
    IMGBODYW       => 90,
    IMGBODYH       => 130,
    DIR            => "$sow->{'cfg'}->{'DIR_IMG'}/portrate",
    EXT            => '.jpg',
    BODY           => '',
    FACE           => '',
    GRAVE          => '',
    EXPRESSION     => \@expression,
    LAYOUT_NAME    => 'right',
  );

  return \%charset;
}

1;
